results/exp1/20260225T014131Z-direct-nginx/raw/wrk/c64/run-3.txt
Running 1m test @ http://192.168.100.1:8080/exp1-1k.txt
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   249.88us   48.53us   2.69ms   73.00%
    Req/Sec    63.25k     4.86k   86.26k    77.11%
  Latency Distribution
     50%  241.00us
     75%  274.00us
     90%  320.00us
     99%  376.00us
  15122396 requests in 1.00m, 17.93GB read
Requests/sec: 251622.51
Transfer/sec:    305.48MB